## Install Libraries

In [4]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\nabhs\anaconda3\lib\site-packages (1.3.9)
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install lxml

Requirement already satisfied: lxml in c:\users\nabhs\anaconda3\lib\site-packages (4.4.1)
Note: you may need to restart the kernel to use updated packages.

In [7]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\nabhs\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: webencodings in c:\users\nabhs\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\nabhs\anaconda3\lib\site-packages (from html5lib) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [8]:
pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\nabhs\anaconda3\lib\site-packages (4.8.0)
Requirement already satisfied: soupsieve>=1.2 in c:\users\nabhs\anaconda3\lib\site-packages (from BeautifulSoup4) (1.9.3)
Note: you may need to restart the kernel to use updated packages.

In [9]:
import pandas as pd

In [10]:
pwd

'C:\\Users\\nabhs\\Python 3 - My Learning'

In [16]:
df=pd.read_csv('C://Users//nabhs//Desktop//Db//DATA UPLOAD//FIRE_SIZE.csv').head()
df

  Fire_Size_Id  Fire_Size Fire_Size_Class
0          FS0    0.00001               A
1          FS1    0.00009               A
2         FS10    0.00100               A
3        FS100    0.12000               A
4       FS1000    6.65000               B

In [17]:
df.to_csv('my_output')

In [18]:
pd.read_csv('my_output')

   Unnamed: 0 Fire_Size_Id  Fire_Size Fire_Size_Class
0           0          FS0    0.00001               A
1           1          FS1    0.00009               A
2           2         FS10    0.00100               A
3           3        FS100    0.12000               A
4           4       FS1000    6.65000               B

In [24]:
df.to_csv('my_output',index=False)

In [25]:
pd.read_csv('my_output')

  Fire_Size_Id  Fire_Size Fire_Size_Class
0          FS0    0.00001               A
1          FS1    0.00009               A
2         FS10    0.00100               A
3        FS100    0.12000               A
4       FS1000    6.65000               B

In [30]:
df1=pd.read_excel('C://Users//nabhs//Desktop//APics Graphs.xlsx',sheet_name='Sheet6').head()
df1

                       Unnamed: 0  FullFilled  Deficient
0               Warehouse is full   62.138889       38.0
1                Delay in Staging   72.190476       28.0
2          Misplaced in Warehouse   32.033333       68.0
3  Not received in system (Yard)    44.322917       56.0
4                          Others   51.385417       49.0

In [32]:
df1.to_excel('my_excel.xlsx',sheet_name='new_sheet')

In [37]:
pd.read_excel('my_excel.xlsx')

   Unnamed: 0                    Unnamed: 0.1  FullFilled  Deficient
0           0               Warehouse is full   62.138889         38
1           1                Delay in Staging   72.190476         28
2           2          Misplaced in Warehouse   32.033333         68
3           3  Not received in system (Yard)    44.322917         56
4           4                          Others   51.385417         49

In [38]:
data = pd.read_html('https://www.worldometers.info/coronavirus/')

In [45]:
type(data)

list

In [47]:
data

[           Country,Other  TotalCases NewCases  TotalDeaths  NewDeaths  \
 0                  China       80849      +25       3199.0       10.0
 1                  Italy       24747   +3,590       1809.0      368.0
 2                   Iran       13938   +1,209        724.0      113.0
 3               S. Korea        8162      +76         75.0        3.0
 4                  Spain        7843   +1,452        292.0       96.0
 ..                   ...         ...      ...          ...        ...
 154             Suriname           1      NaN          NaN        NaN
 155             Eswatini           1      NaN          NaN        NaN
 156                 Togo           1      NaN          NaN        NaN
 157  U.S. Virgin Islands           1      NaN          NaN        NaN
 158               Total:      168903    12301       6492.0      669.0

      TotalRecovered  ActiveCases  Serious,Critical  Tot Cases/1M pop
 0           66931.0        10719            3226.0              56.2
 1            2335.0        20603            1672.0             409.3
 2            4590.0         8624               NaN             165.9
 3             834.0         7253              59.0             159.2
 4             517.0         7034             272.0             167.7
 ..              ...          ...               ...               ...
 154             NaN            1               NaN               NaN
 155             NaN            1               NaN               0.9
 156             NaN            1               NaN               0.1
 157             NaN            1               NaN               NaN
 158         76598.0        85813            5913.0              21.7

 [159 rows x 9 columns]]

In [49]:
data[0].head()

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop
0,China,80849,+25,3199.0,10.0,66931.0,10719,3226.0,56.2
1,Italy,24747,"+3,590",1809.0,368.0,2335.0,20603,1672.0,409.3
2,Iran,13938,"+1,209",724.0,113.0,4590.0,8624,NaN,165.9
3,S. Korea,8162,+76,75.0,3.0,834.0,7253,59.0,159.2
4,Spain,7843,"+1,452",292.0,96.0,517.0,7034,272.0,167.7

In [51]:
from sqlalchemy import create_engine

## In-Memory SQL

In [52]:
engine = create_engine('sqlite:///:memory:')

In [53]:
data[0].to_sql('my_table',engine)

In [60]:
pd.read_sql('my_table',engine).head()

,index,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop
0,0,China,80849,+25,3199.0,10.0,66931.0,10719,3226.0,56.2
1,1,Italy,24747,"+3,590",1809.0,368.0,2335.0,20603,1672.0,409.3
2,2,Iran,13938,"+1,209",724.0,113.0,4590.0,8624,NaN,165.9
3,3,S. Korea,8162,+76,75.0,3.0,834.0,7253,59.0,159.2
4,4,Spain,7843,"+1,452",292.0,96.0,517.0,7034,272.0,167.7